[
  {
    "reviews": [
      {
        "text": "Great course, learned a lot!",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your positive feedback!"
      },
      {
        "text": "The course material was outdated. Not recommended.",
        "evaluation": 2,
        "teacherAnswer": "We appreciate your feedback and will work on improving the course material."
      },
      {
        "text": "Highly engaging and interactive sessions. Loved it!",
        "evaluation": 4,
        "teacherAnswer": "We're glad you enjoyed the course. Thank you for your feedback!"
      },
      {
        "text": "Disorganized structure, often felt lost.",
        "evaluation": 2,
        "teacherAnswer": "We apologize for any confusion caused. We'll take your feedback into consideration for future improvements."
      },
      {
        "text": "The instructor was very knowledgeable and helpful.",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your kind words! We're happy to know that you found our instructor helpful."
      },
      {
        "text": "Limited practical exercises provided.",
        "evaluation": 3,
        "teacherAnswer": "We appreciate your feedback regarding the practical exercises. We'll strive to include more in future updates."
      },
      {
        "text": "The course content was too basic for my expectations.",
        "evaluation": 2,
        "teacherAnswer": "We apologize if the course didn't meet your expectations. We'll keep your feedback in mind for future improvements."
      },
      {
        "text": "Instructor was engaging and explained complex concepts in a simplified manner.",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your positive feedback! We're glad you found our instructor engaging."
      },
      {
        "text": "Lack of real-world examples made it hard to apply the concepts learned.",
        "evaluation": 3,
        "teacherAnswer": "We appreciate your feedback and will consider incorporating more real-world examples in the course material."
      },
      {
        "text": "The course was well-structured, building upon each topic effectively.",
        "evaluation": 4,
        "teacherAnswer": "Thank you for your feedback! We're glad you found the course well-structured."
      },
      {
        "text": "Outstanding course, worth every penny!",
        "evaluation": 5,
        "teacherAnswer": "We're thrilled to hear that you found our course outstanding. Thank you for your positive feedback!"
      },
      {
        "text": "The course material was comprehensive and easy to follow.",
        "evaluation": 4,
        "teacherAnswer": "We're glad you found the course material comprehensive and easy to follow. Thank you for your feedback!"
      },
      {
        "text": "The course lacked depth in certain topics.",
        "evaluation": 3,
        "teacherAnswer": "We appreciate your feedback and will work on expanding the depth of certain topics in the course."
      },
      {
        "text": "The instructor was unresponsive to student queries.",
        "evaluation": 1,
        "teacherAnswer": "We apologize for the unsatisfactory experience. Your feedback will help us improve our responsiveness."
      },
      {
        "text": "The course provided a solid foundation for web development.",
        "evaluation": 4,
        "teacherAnswer": "We're thrilled to hear that you found the course helpful in building a solid foundation. Thank you for your feedback!"
      }
    ],
    "courseId": "64bdb4526e784880349b5c0d",
    "userId": "64a2186f18659a0695145e33",
    "title": "Introduction to Web Development"
  },
  {
    "reviews": [
      {
        "text": "Great course! I learned so much.",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your feedback!"
      },
      {
        "text": "The course content was thorough and easy to follow.",
        "evaluation": 4,
        "teacherAnswer": "We appreciate your positive review!"
      },
      {
        "text": "This course exceeded my expectations. Highly recommended.",
        "evaluation": 4,
        "teacherAnswer": "We're glad you enjoyed the course!"
      },
      {
        "text": "I found the explanations clear and concise.",
        "evaluation": 3,
        "teacherAnswer": "Thank you for your feedback. We'll work on improving."
      },
      {
        "text": "Lack of real-life examples made it difficult to understand some concepts.",
        "evaluation": 2,
        "teacherAnswer": "We appreciate your input and will consider adding more examples."
      },
      {
        "text": "The quizzes were too easy and didn't challenge me enough.",
        "evaluation": 3,
        "teacherAnswer": "We'll keep your feedback in mind while updating the quizzes."
      },
      {
        "text": "The course layout was confusing and disorganized.",
        "evaluation": 1,
        "teacherAnswer": "We apologize for the inconvenience. We'll work on improving the course structure."
      },
      {
        "text": "The video lectures were engaging and kept me interested throughout.",
        "evaluation": 4,
        "teacherAnswer": "We're glad you enjoyed the lectures!"
      },
      {
        "text": "The course materials were comprehensive and well-presented.",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your positive feedback! It means a lot."
      },
      {
        "text": "I would have liked more hands-on practice exercises.",
        "evaluation": 3,
        "teacherAnswer": "Noted! We'll try to incorporate more practice exercises in the future."
      },
      {
        "text": "The course was a bit too basic for my level of understanding.",
        "evaluation": 2,
        "teacherAnswer": "We apologize if the course content didn't meet your expectations."
      },
      {
        "text": "The course helped me build a strong foundation in HTML.",
        "evaluation": 5,
        "teacherAnswer": "That's great to hear! Keep up the good work."
      },
      {
        "text": "The instructor was knowledgeable and answered questions promptly.",
        "evaluation": 4,
        "teacherAnswer": "We appreciate your positive feedback about the instructor."
      },
      {
        "text": "I expected more interactive elements in the course material.",
        "evaluation": 3,
        "teacherAnswer": "Thank you for your input. We'll consider adding more interactive elements."
      },
      {
        "text": "The course was informative, but the pace was a bit slow for me.",
        "evaluation": 3,
        "teacherAnswer": "We'll take your feedback into account for future improvements."
      }
    ],
    "courseId": "64bdb4536e784880349b5c14",
    "userId": "64a26e28ea125e0f4b304c1f",
    "title": "HTML Foundations"
  },
  {
    "reviews": [
      {
        "text": "Great course, learned a lot!",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your feedback!"
      },
      {
        "text": "The course was informative and well-structured.",
        "evaluation": 4,
        "teacherAnswer": "Glad you found the course helpful!"
      },
      {
        "text": "Disappointed with the lack of practical exercises.",
        "evaluation": 2,
        "teacherAnswer": "We appreciate your feedback and will work on improving the practical exercises."
      },
      {
        "text": "The instructor explained complex concepts clearly.",
        "evaluation": 4,
        "teacherAnswer": "Thank you for your kind words!"
      },
      {
        "text": "Too many typos in the course materials.",
        "evaluation": 3,
        "teacherAnswer": "We apologize for the inconvenience and will make sure to correct any typos."
      },
      {
        "text": "The course provided valuable tips and tricks.",
        "evaluation": 5,
        "teacherAnswer": "We're thrilled to hear that you found the tips helpful!"
      },
      {
        "text": "Not enough examples to practice on.",
        "evaluation": 2,
        "teacherAnswer": "We appreciate your feedback and will consider adding more examples for practice."
      },
      {
        "text": "The content was outdated, needs to be updated.",
        "evaluation": 2,
        "teacherAnswer": "Thank you for bringing this to our attention. We'll make sure to update the content."
      },
      {
        "text": "The instructor was engaging and knowledgeable.",
        "evaluation": 5,
        "teacherAnswer": "Thank you! We're glad you enjoyed the instructor's teaching style."
      },
      {
        "text": "The course exceeded my expectations.",
        "evaluation": 5,
        "teacherAnswer": "We're thrilled to hear that! Thank you for your support."
      },
      {
        "text": "The course lacked clear explanations of certain topics.",
        "evaluation": 3,
        "teacherAnswer": "We apologize for any confusion. We'll make sure to provide clearer explanations in the future."
      },
      {
        "text": "The materials were well-organized and easy to follow.",
        "evaluation": 4,
        "teacherAnswer": "That's great to hear! We put a lot of effort into organizing the materials."
      },
      {
        "text": "The course was a bit repetitive at times.",
        "evaluation": 3,
        "teacherAnswer": "We appreciate your feedback. We'll take note of this for future improvements."
      },
      {
        "text": "The course helped me improve my CSS skills significantly.",
        "evaluation": 5,
        "teacherAnswer": "That's wonderful to hear! Keep up the great work!"
      },
      {
        "text": "The course lacked real-life examples.",
        "evaluation": 3,
        "teacherAnswer": "Thank you for your feedback. We'll work on incorporating more real-life examples."
      }
    ],
    "courseId": "64bdb4536e784880349b5c1b",
    "userId": "64a26b65ea125e0f4b304c11",
    "title": "CSS Styling Techniques"
  },
  {
    "reviews": [
      {
        "text": "This course is a great introduction to JavaScript. The concepts are explained clearly and the exercises are practical. I would highly recommend it.",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your feedback! We're glad you found the course helpful."
      },
      {
        "text": "I found this course to be quite challenging. The instructor moves quickly through the material and I had to spend extra time on my own to fully understand some concepts. I would give it a 3 out of 5.",
        "evaluation": 3,
        "teacherAnswer": "We appreciate your feedback. We understand that the pace may be fast for some learners, but we're here to support you in your learning journey."
      },
      {
        "text": "The JavaScript Fundamentals course exceeded my expectations. The instructor's teaching style is engaging and the course content is comprehensive. I would rate it a solid 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "Thanks for taking the time to provide your feedback. We're thrilled to hear that you enjoyed the course!"
      },
      {
        "text": "I took this course as a complete beginner in programming, and it was the perfect starting point. The explanations are clear and the exercises helped solidify my understanding. I would give it a 5 out of 5.",
        "evaluation": 5,
        "teacherAnswer": "We're delighted to hear that the course was helpful for you as a beginner. Keep up the great work!"
      },
      {
        "text": "I was disappointed with the JavaScript Fundamentals course. The lessons were too basic and didn't dive deep enough into advanced topics. I would rate it a 2 out of 5.",
        "evaluation": 2,
        "teacherAnswer": "We're sorry to hear that the course didn't meet your expectations. We value your feedback and will take it into consideration for future updates."
      },
      {
        "text": "I have taken several JavaScript courses before, but this one stands out. The instructor covers complex topics with ease and provides excellent examples. A definite 5 out of 5!",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your kind words! We're thrilled to hear that you found the course valuable despite your previous experience."
      },
      {
        "text": "I enjoyed the JavaScript Fundamentals course overall. The lectures were well-structured and the quizzes helped reinforce the material. I would rate it a solid 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "We appreciate your feedback! It's great to know that the course structure and quizzes were beneficial to your learning experience."
      },
      {
        "text": "This course made learning JavaScript fun and engaging. The instructor's enthusiasm is contagious. I would highly recommend it to anyone starting their coding journey. Solid 5 out of 5!",
        "evaluation": 5,
        "teacherAnswer": "Thank you for your enthusiastic review! We're thrilled to know that you enjoyed the course and found it engaging."
      },
      {
        "text": "I initially struggled with some concepts in this course, but the instructor was always available to answer questions and provide support. I would rate it a 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "We're glad to hear that you found our support helpful during your learning journey. Don't hesitate to reach out if you have any further questions."
      },
      {
        "text": "The JavaScript Fundamentals course was a bit disappointing. The content felt outdated and the pace was too slow for my liking. I would give it a 2 out of 5.",
        "evaluation": 2,
        "teacherAnswer": "We apologize if the course didn't meet your expectations. Your feedback is valuable to us and we'll strive to improve the content and pace in future updates."
      },
      {
        "text": "I have taken multiple JavaScript courses in the past, and this one is by far the best. The instructor breaks down complex concepts into manageable chunks and provides helpful real-world examples. A solid 5 out of 5!",
        "evaluation": 5,
        "teacherAnswer": "Thanks for your positive review! We're delighted to hear that you found the course to be the best among the ones you've taken before."
      },
      {
        "text": "The JavaScript Fundamentals course is excellent for beginners. The explanations are clear and the exercises are well-structured. I would rate it a 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "We're glad to hear that the course worked well for you as a beginner. Keep up the great work!"
      },
      {
        "text": "I was expecting more challenging exercises in this course. The content was too easy for my level. I would give it a 2 out of 5.",
        "evaluation": 2,
        "teacherAnswer": "We apologize if the course didn't meet your expectations in terms of challenge level. Your feedback will help us improve the course for future learners."
      },
      {
        "text": "As an experienced programmer, I found this course to be a great refresher. The material is presented concisely and the examples are relevant. A solid 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "Thank you for your feedback! We're glad to know that the course served as a valuable refresher for you."
      },
      {
        "text": "This course provided a solid foundation in JavaScript. The instructor's explanations were easy to follow and the exercises solidified my understanding. I would rate it a 4 out of 5.",
        "evaluation": 4,
        "teacherAnswer": "We appreciate your review! It's great to know that the course helped build a solid foundation in JavaScript for you."
      }
    ],
    "courseId": "64bdb4536e784880349b5c22",
    "userId": "64a2c4c75f01004c70e7e37a",
    "title": "JavaScript Fundamentals"
  }
]